## Introduction to Data Wrangling and Tidying

## Data Wrangling

Let’s look at a subset of restaurant inspections from the New York City Department of Health and Mental Hygiene (NYC DOHMH) to work through some data wrangling processes. The data includes seven different columns with information about a restaurant’s location and health inspection. Here is a description of the dataset’s variables.
```
Pos.    Var. Name                 Var. Description
-----   --------------------      --------------------------------------
0       DBA                       Restaurant name
1       BORO                      Borough
2       CUISINE DESCRIPTION       Type of cuisine
3       GRADE                     Letter grade
4       LATITUDE                  Latitude coordinates of restaurant 
5       LONGITUDE                 Longitude coordinates of restaurant 
6       URL                       URL link to restaurant's website
```

Let’s use the read_csv() function in pandas to load our dataset as a pandas dataframe and take a look at the first 10 rows out of the 27 total.

In [46]:
import pandas as pd
import numpy as np

restaurants = pd.read_csv('/home/oldoc/largeDataSets/DOHMH_New_York_City_Restaurant_Inspection_Results.csv')

In [47]:
# the .head(10) function will show us the first 10 rows in our dataset
print(restaurants.head(10))

      CAMIS                           DBA           BORO BUILDING  \
0  40511702             NOTARO RESTAURANT      MANHATTAN      635
1  40511702             NOTARO RESTAURANT      MANHATTAN      635
2  50046354                      VITE BAR         QUEENS     2507
3  50061389       TACK'S CHINESE TAKE OUT  STATEN ISLAND      11C
4  41516263                    NO QUARTER       BROOKLYN     8015
5  50015855               KABAB HOUSE NYC         QUEENS     4339
6  50058069              HENRI'S BACKYARD       BROOKLYN      256
7  40807238  RICHMOND COUNTY COUNTRY CLUB  STATEN ISLAND     1122
8  41547684                  PLANET WINGS  STATEN ISLAND      480
9  40376944                   TOMOE SUSHI      MANHATTAN      172

            STREET  ZIPCODE       PHONE CUISINE DESCRIPTION INSPECTION DATE  \
0    SECOND AVENUE  10016.0  2126863400             Italian      06/15/2015
1    SECOND AVENUE  10016.0  2126863400             Italian      11/25/2014
2         BROADWAY  11106.0  3478134702             Italian      10/03/2016
3      HOLDEN BLVD  10314.0  7189839854             Chinese      05/17/2017
4         5 AVENUE  11209.0  7187019180            American      03/30/2017
5          MAIN ST  11355.0  9172852796           Pakistani      03/03/2015
6          4TH AVE  11215.0  9293378443            American      06/22/2017
7   TODT HILL ROAD  10304.0  7183510600            American      06/14/2017
8    FOREST AVENUE  10310.0  7187209464            American      03/10/2015
9  THOMPSON STREET  10012.0  2127779346            Japanese      10/06/2015

                                            ACTION VIOLATION CODE  \
0  Violations were cited in the following area(s).            02B
1  Violations were cited in the following area(s).            20F
2  Violations were cited in the following area(s).            10F
3  Violations were cited in the following area(s).            02G
4  Violations were cited in the following area(s).            04M
5  Violations were cited in the following area(s).            10F
6  Violations were cited in the following area(s).            04K
7  Violations were cited in the following area(s).            02G
8  Violations were cited in the following area(s).            02G
9  Violations were cited in the following area(s).            02G

                               VIOLATION DESCRIPTION CRITICAL FLAG  SCORE  \
0        Hot food item not held at or above 140Âº F.      Critical   30.0
1              Current letter grade card not posted.  Not Critical    NaN
2  Non-food contact surface improperly constructe...  Not Critical    2.0
3  Cold food item held above 41Âº F (smoked fish ...      Critical   46.0
4  Live roaches present in facility's food and/or...      Critical   18.0
5  Non-food contact surface improperly constructe...  Not Critical   19.0
6  Evidence of rats or live rats present in facil...      Critical   39.0
7  Cold food item held above 41Âº F (smoked fish ...      Critical   12.0
8  Cold food item held above 41Âº F (smoked fish ...      Critical   28.0
9  Cold food item held above 41Âº F (smoked fish ...      Critical   13.0

  GRADE  GRADE DATE RECORD DATE  \
0   NaN         NaN  08/28/2017
1   NaN         NaN  08/28/2017
2   NaN         NaN  08/28/2017
3   NaN         NaN  08/28/2017
4   NaN         NaN  08/28/2017
5   NaN         NaN  08/28/2017
6     C  06/22/2017  08/28/2017
7     A  06/14/2017  08/28/2017
8   NaN         NaN  08/28/2017
9     A  10/06/2015  08/28/2017

                                     INSPECTION TYPE
0              Cycle Inspection / Initial Inspection
1  Administrative Miscellaneous / Initial Inspection
2      Pre-permit (Operational) / Initial Inspection
3      Pre-permit (Operational) / Initial Inspection
4              Cycle Inspection / Initial Inspection
5   Pre-permit (Operational) / Compliance Inspection
6           Pre-permit (Operational) / Re-inspection
7              Cycle Inspection / Initial Inspection
8              Cycle Inspection / Initial Inspection
9                   Cycle Inspection / Re-inspection

In [48]:
restaurants.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 399918 entries, 0 to 399917
Data columns (total 18 columns):
 #   Column                 Non-Null Count   Dtype
---  ------                 --------------   -----
 0   CAMIS                  399918 non-null  int64
 1   DBA                    399559 non-null  object
 2   BORO                   399918 non-null  object
 3   BUILDING               399809 non-null  object
 4   STREET                 399909 non-null  object
 5   ZIPCODE                399909 non-null  float64
 6   PHONE                  399913 non-null  object
 7   CUISINE DESCRIPTION    399918 non-null  object
 8   INSPECTION DATE        399918 non-null  object
 9   ACTION                 398783 non-null  object
 10  VIOLATION CODE         393414 non-null  object
 11  VIOLATION DESCRIPTION  392939 non-null  object
 12  CRITICAL FLAG          399918 non-null  object
 13  SCORE                  376704 non-null  float64
 14  GRADE                  195413 non-null  object
 15  GRADE DATE             192820 non-null  object
 16  RECORD DATE            399918 non-null  object
 17  INSPECTION TYPE        398783 non-null  object
dtypes: float64(2), int64(1), object(15)
memory usage: 54.9+ MB

In [49]:
# the .shape method in pandas identifies the number of rows and columns in our dataset as (rows, columns)
restaurants.shape

(399918, 18)

When we look closely at the table, we see some missing data. In both GRADE and URL columns, we have missing values marked as NaNs. In the Latitude and Longitude columns, we have a missing set of coordinates marked as (0.000, 0.000) for IHOP. (0.000, 0.000) is the label for missing coordinates because no restaurants in New York City are at the equator. Other common indicators used for missing values are values that are NA and -.

### Preliminary data cleaning

There are also duplicate rows for the restaurant labeled Seamore’s. To remove any duplicate rows, we can use the drop_duplicates() function

In [50]:
# the .drop_duplicates() function removes duplicate rows
restaurants = restaurants.drop_duplicates()

In [51]:
# the .head(10) function will show us the first 10 rows in our dataset
print(restaurants.head(10))

      CAMIS                           DBA           BORO BUILDING  \
0  40511702             NOTARO RESTAURANT      MANHATTAN      635
1  40511702             NOTARO RESTAURANT      MANHATTAN      635
2  50046354                      VITE BAR         QUEENS     2507
3  50061389       TACK'S CHINESE TAKE OUT  STATEN ISLAND      11C
4  41516263                    NO QUARTER       BROOKLYN     8015
5  50015855               KABAB HOUSE NYC         QUEENS     4339
6  50058069              HENRI'S BACKYARD       BROOKLYN      256
7  40807238  RICHMOND COUNTY COUNTRY CLUB  STATEN ISLAND     1122
8  41547684                  PLANET WINGS  STATEN ISLAND      480
9  40376944                   TOMOE SUSHI      MANHATTAN      172

            STREET  ZIPCODE       PHONE CUISINE DESCRIPTION INSPECTION DATE  \
0    SECOND AVENUE  10016.0  2126863400             Italian      06/15/2015
1    SECOND AVENUE  10016.0  2126863400             Italian      11/25/2014
2         BROADWAY  11106.0  3478134702             Italian      10/03/2016
3      HOLDEN BLVD  10314.0  7189839854             Chinese      05/17/2017
4         5 AVENUE  11209.0  7187019180            American      03/30/2017
5          MAIN ST  11355.0  9172852796           Pakistani      03/03/2015
6          4TH AVE  11215.0  9293378443            American      06/22/2017
7   TODT HILL ROAD  10304.0  7183510600            American      06/14/2017
8    FOREST AVENUE  10310.0  7187209464            American      03/10/2015
9  THOMPSON STREET  10012.0  2127779346            Japanese      10/06/2015

                                            ACTION VIOLATION CODE  \
0  Violations were cited in the following area(s).            02B
1  Violations were cited in the following area(s).            20F
2  Violations were cited in the following area(s).            10F
3  Violations were cited in the following area(s).            02G
4  Violations were cited in the following area(s).            04M
5  Violations were cited in the following area(s).            10F
6  Violations were cited in the following area(s).            04K
7  Violations were cited in the following area(s).            02G
8  Violations were cited in the following area(s).            02G
9  Violations were cited in the following area(s).            02G

                               VIOLATION DESCRIPTION CRITICAL FLAG  SCORE  \
0        Hot food item not held at or above 140Âº F.      Critical   30.0
1              Current letter grade card not posted.  Not Critical    NaN
2  Non-food contact surface improperly constructe...  Not Critical    2.0
3  Cold food item held above 41Âº F (smoked fish ...      Critical   46.0
4  Live roaches present in facility's food and/or...      Critical   18.0
5  Non-food contact surface improperly constructe...  Not Critical   19.0
6  Evidence of rats or live rats present in facil...      Critical   39.0
7  Cold food item held above 41Âº F (smoked fish ...      Critical   12.0
8  Cold food item held above 41Âº F (smoked fish ...      Critical   28.0
9  Cold food item held above 41Âº F (smoked fish ...      Critical   13.0

  GRADE  GRADE DATE RECORD DATE  \
0   NaN         NaN  08/28/2017
1   NaN         NaN  08/28/2017
2   NaN         NaN  08/28/2017
3   NaN         NaN  08/28/2017
4   NaN         NaN  08/28/2017
5   NaN         NaN  08/28/2017
6     C  06/22/2017  08/28/2017
7     A  06/14/2017  08/28/2017
8   NaN         NaN  08/28/2017
9     A  10/06/2015  08/28/2017

                                     INSPECTION TYPE
0              Cycle Inspection / Initial Inspection
1  Administrative Miscellaneous / Initial Inspection
2      Pre-permit (Operational) / Initial Inspection
3      Pre-permit (Operational) / Initial Inspection
4              Cycle Inspection / Initial Inspection
5   Pre-permit (Operational) / Compliance Inspection
6           Pre-permit (Operational) / Re-inspection
7              Cycle Inspection / Initial Inspection
8              Cycle Inspection / Initial Inspection
9                   Cycle Inspection / Re-inspection

In [52]:
# the .shape method in pandas identifies the number of rows and columns in our dataset as (rows, columns)
restaurants.shape

(399907, 18)

You may have noticed that the column of the dataset called DBA, but we know it is a column with restaurant names. We can use the rename() function and a dictionary to relabel our columns. While we are renaming our columns, we might also want to shorten the cuisine description column to just cuisine.

In [53]:
# axis=1` refers to the columns, `axis=0` would refer to the rows
# In the dictionary the key refers to the original column name and the value refers to the new column name {'oldname1': 'newname1', 'oldname2': 'newname2'}
restaurants = restaurants.rename({'DBA':'NAME', 'CUISINE DESCRIPTION':'CUISINE'}, axis=1)

In [54]:
# the .head(10) function will show us the first 10 rows in our dataset
print(restaurants.head(10))

      CAMIS                          NAME           BORO BUILDING  \
0  40511702             NOTARO RESTAURANT      MANHATTAN      635
1  40511702             NOTARO RESTAURANT      MANHATTAN      635
2  50046354                      VITE BAR         QUEENS     2507
3  50061389       TACK'S CHINESE TAKE OUT  STATEN ISLAND      11C
4  41516263                    NO QUARTER       BROOKLYN     8015
5  50015855               KABAB HOUSE NYC         QUEENS     4339
6  50058069              HENRI'S BACKYARD       BROOKLYN      256
7  40807238  RICHMOND COUNTY COUNTRY CLUB  STATEN ISLAND     1122
8  41547684                  PLANET WINGS  STATEN ISLAND      480
9  40376944                   TOMOE SUSHI      MANHATTAN      172

            STREET  ZIPCODE       PHONE    CUISINE INSPECTION DATE  \
0    SECOND AVENUE  10016.0  2126863400    Italian      06/15/2015
1    SECOND AVENUE  10016.0  2126863400    Italian      11/25/2014
2         BROADWAY  11106.0  3478134702    Italian      10/03/2016
3      HOLDEN BLVD  10314.0  7189839854    Chinese      05/17/2017
4         5 AVENUE  11209.0  7187019180   American      03/30/2017
5          MAIN ST  11355.0  9172852796  Pakistani      03/03/2015
6          4TH AVE  11215.0  9293378443   American      06/22/2017
7   TODT HILL ROAD  10304.0  7183510600   American      06/14/2017
8    FOREST AVENUE  10310.0  7187209464   American      03/10/2015
9  THOMPSON STREET  10012.0  2127779346   Japanese      10/06/2015

                                            ACTION VIOLATION CODE  \
0  Violations were cited in the following area(s).            02B
1  Violations were cited in the following area(s).            20F
2  Violations were cited in the following area(s).            10F
3  Violations were cited in the following area(s).            02G
4  Violations were cited in the following area(s).            04M
5  Violations were cited in the following area(s).            10F
6  Violations were cited in the following area(s).            04K
7  Violations were cited in the following area(s).            02G
8  Violations were cited in the following area(s).            02G
9  Violations were cited in the following area(s).            02G

                               VIOLATION DESCRIPTION CRITICAL FLAG  SCORE  \
0        Hot food item not held at or above 140Âº F.      Critical   30.0
1              Current letter grade card not posted.  Not Critical    NaN
2  Non-food contact surface improperly constructe...  Not Critical    2.0
3  Cold food item held above 41Âº F (smoked fish ...      Critical   46.0
4  Live roaches present in facility's food and/or...      Critical   18.0
5  Non-food contact surface improperly constructe...  Not Critical   19.0
6  Evidence of rats or live rats present in facil...      Critical   39.0
7  Cold food item held above 41Âº F (smoked fish ...      Critical   12.0
8  Cold food item held above 41Âº F (smoked fish ...      Critical   28.0
9  Cold food item held above 41Âº F (smoked fish ...      Critical   13.0

  GRADE  GRADE DATE RECORD DATE  \
0   NaN         NaN  08/28/2017
1   NaN         NaN  08/28/2017
2   NaN         NaN  08/28/2017
3   NaN         NaN  08/28/2017
4   NaN         NaN  08/28/2017
5   NaN         NaN  08/28/2017
6     C  06/22/2017  08/28/2017
7     A  06/14/2017  08/28/2017
8   NaN         NaN  08/28/2017
9     A  10/06/2015  08/28/2017

                                     INSPECTION TYPE
0              Cycle Inspection / Initial Inspection
1  Administrative Miscellaneous / Initial Inspection
2      Pre-permit (Operational) / Initial Inspection
3      Pre-permit (Operational) / Initial Inspection
4              Cycle Inspection / Initial Inspection
5   Pre-permit (Operational) / Compliance Inspection
6           Pre-permit (Operational) / Re-inspection
7              Cycle Inspection / Initial Inspection
8              Cycle Inspection / Initial Inspection
9                   Cycle Inspection / Re-inspection

### Data Types

Let’s take a look at each column’s data types by appending .dtypes to our pandas dataframe.

In [55]:
restaurants.dtypes

CAMIS                      int64
NAME                      object
BORO                      object
BUILDING                  object
STREET                    object
ZIPCODE                  float64
PHONE                     object
CUISINE                   object
INSPECTION DATE           object
ACTION                    object
VIOLATION CODE            object
VIOLATION DESCRIPTION     object
CRITICAL FLAG             object
SCORE                    float64
GRADE                     object
GRADE DATE                object
RECORD DATE               object
INSPECTION TYPE           object
dtype: object

We have two types of variables: object and float64. object can consist of both strings or mixed types (both numeric and non-numeric), and float64 are numbers with a floating point (ie. numbers with decimals). There are other data types such as int64 (integer numbers), bool (True/False values), and datetime64 (date and/or time values). 

Since we have both continuous (float64) and categorical (object) variables in our data, it might be informative to look at the number of unique values in each column using the nunique() function.

In [56]:
# .nunique() counts the number of unique values in each column 
restaurants.nunique()

CAMIS                    26505
NAME                     20936
BORO                         6
BUILDING                  7256
STREET                    3328
ZIPCODE                    233
PHONE                    25165
CUISINE                     84
INSPECTION DATE           1414
ACTION                       5
VIOLATION CODE              97
VIOLATION DESCRIPTION       93
CRITICAL FLAG                3
SCORE                      120
GRADE                        6
GRADE DATE                1325
RECORD DATE                  1
INSPECTION TYPE             34
dtype: int64

### Missing Data

From our initial inspection of the data, we know we have missing data in grade, url, latitude, and longitude. Let’s take a look at how the data is missing, also referred to as missingness. To do this we can use isna() to identify if the value is missing. This will give us a boolean and indicate if the observation in that column is missing (True) or not (False). We will also use sum() to count the number of missing values, where isna() returns True.

In [57]:
# counts the number of missing values in each column 
restaurants.isna().sum()

CAMIS                         0
NAME                        359
BORO                          0
BUILDING                    109
STREET                        9
ZIPCODE                       9
PHONE                         5
CUISINE                       0
INSPECTION DATE               0
ACTION                     1135
VIOLATION CODE             6504
VIOLATION DESCRIPTION      6974
CRITICAL FLAG                 0
SCORE                     23207
GRADE                    204494
GRADE DATE               207087
RECORD DATE                   0
INSPECTION TYPE            1135
dtype: int64

In [58]:
restaurants_grade = restaurants[['GRADE']]
restaurants_grade.value_counts()

GRADE
A                 154194
B                  28166
C                   6992
Not Yet Graded      2598
Z                   2104
P                   1359
dtype: int64

In [59]:
restaurants_score = restaurants[['SCORE']]
restaurants_score.describe()

               SCORE
count  376700.000000
mean       18.910138
std        12.959017
min        -2.000000
25%        11.000000
50%        15.000000
75%        24.000000
max       151.000000

In [60]:
# here our .where() function replaces latitude values less than 40 with NaN values
restaurants['SCORE'] = restaurants['SCORE'].where(restaurants['SCORE'] < 0, np.nan)

In [61]:
# counts the number of missing values in each column 
restaurants.isna().sum()

CAMIS                         0
NAME                        359
BORO                          0
BUILDING                    109
STREET                        9
ZIPCODE                       9
PHONE                         5
CUISINE                       0
INSPECTION DATE               0
ACTION                     1135
VIOLATION CODE             6504
VIOLATION DESCRIPTION      6974
CRITICAL FLAG                 0
SCORE                    399791
GRADE                    204494
GRADE DATE               207087
RECORD DATE                   0
INSPECTION TYPE            1135
dtype: int64

### Characterizing missingness with crosstab

Let's try to understand the missingness in the url column by counting the missing values across each borough. We will use the crosstab() function in pandas to do this.

Te crosstab() computes the frequency of two or more variables. To look at the missingness in the url column we can add isna() to the column to identify if there is an NaN in that column. This will return a boolean, True if there is a NaN and False if there is not. In our crosstab, we will look at all the boroughs present in our data and whether or not they have missing url links.

In [62]:
pd.crosstab(
    # tabulates the boroughs as the index
    restaurants['BORO'],
    # tabulates the number of missing values in the url column as columns
    restaurants['PHONE'].isna(),
    # names the rows
    rownames=['BORO'],
    # names the columns
    colnames=['PHONE NA']
)

PHONE NA        False  True
BORO
BRONX           34895      0
BROOKLYN        99592      3
MANHATTAN      159566      0
Missing             9      0
QUEENS          92414      1
STATEN ISLAND   13426      1

### Removing prefixes

In [63]:
# .str.lstrip('212') removes the “212” from the left side of the string
restaurants['PHONE'] = restaurants['PHONE'].str.lstrip('212')

In [64]:
# the .head(10) function will show us the first 10 rows in our dataset
print(restaurants.head(10))

      CAMIS                          NAME           BORO BUILDING  \
0  40511702             NOTARO RESTAURANT      MANHATTAN      635
1  40511702             NOTARO RESTAURANT      MANHATTAN      635
2  50046354                      VITE BAR         QUEENS     2507
3  50061389       TACK'S CHINESE TAKE OUT  STATEN ISLAND      11C
4  41516263                    NO QUARTER       BROOKLYN     8015
5  50015855               KABAB HOUSE NYC         QUEENS     4339
6  50058069              HENRI'S BACKYARD       BROOKLYN      256
7  40807238  RICHMOND COUNTY COUNTRY CLUB  STATEN ISLAND     1122
8  41547684                  PLANET WINGS  STATEN ISLAND      480
9  40376944                   TOMOE SUSHI      MANHATTAN      172

            STREET  ZIPCODE       PHONE    CUISINE INSPECTION DATE  \
0    SECOND AVENUE  10016.0     6863400    Italian      06/15/2015
1    SECOND AVENUE  10016.0     6863400    Italian      11/25/2014
2         BROADWAY  11106.0  3478134702    Italian      10/03/2016
3      HOLDEN BLVD  10314.0  7189839854    Chinese      05/17/2017
4         5 AVENUE  11209.0  7187019180   American      03/30/2017
5          MAIN ST  11355.0  9172852796  Pakistani      03/03/2015
6          4TH AVE  11215.0  9293378443   American      06/22/2017
7   TODT HILL ROAD  10304.0  7183510600   American      06/14/2017
8    FOREST AVENUE  10310.0  7187209464   American      03/10/2015
9  THOMPSON STREET  10012.0     7779346   Japanese      10/06/2015

                                            ACTION VIOLATION CODE  \
0  Violations were cited in the following area(s).            02B
1  Violations were cited in the following area(s).            20F
2  Violations were cited in the following area(s).            10F
3  Violations were cited in the following area(s).            02G
4  Violations were cited in the following area(s).            04M
5  Violations were cited in the following area(s).            10F
6  Violations were cited in the following area(s).            04K
7  Violations were cited in the following area(s).            02G
8  Violations were cited in the following area(s).            02G
9  Violations were cited in the following area(s).            02G

                               VIOLATION DESCRIPTION CRITICAL FLAG  SCORE  \
0        Hot food item not held at or above 140Âº F.      Critical    NaN
1              Current letter grade card not posted.  Not Critical    NaN
2  Non-food contact surface improperly constructe...  Not Critical    NaN
3  Cold food item held above 41Âº F (smoked fish ...      Critical    NaN
4  Live roaches present in facility's food and/or...      Critical    NaN
5  Non-food contact surface improperly constructe...  Not Critical    NaN
6  Evidence of rats or live rats present in facil...      Critical    NaN
7  Cold food item held above 41Âº F (smoked fish ...      Critical    NaN
8  Cold food item held above 41Âº F (smoked fish ...      Critical    NaN
9  Cold food item held above 41Âº F (smoked fish ...      Critical    NaN

  GRADE  GRADE DATE RECORD DATE  \
0   NaN         NaN  08/28/2017
1   NaN         NaN  08/28/2017
2   NaN         NaN  08/28/2017
3   NaN         NaN  08/28/2017
4   NaN         NaN  08/28/2017
5   NaN         NaN  08/28/2017
6     C  06/22/2017  08/28/2017
7     A  06/14/2017  08/28/2017
8   NaN         NaN  08/28/2017
9     A  10/06/2015  08/28/2017

                                     INSPECTION TYPE
0              Cycle Inspection / Initial Inspection
1  Administrative Miscellaneous / Initial Inspection
2      Pre-permit (Operational) / Initial Inspection
3      Pre-permit (Operational) / Initial Inspection
4              Cycle Inspection / Initial Inspection
5   Pre-permit (Operational) / Compliance Inspection
6           Pre-permit (Operational) / Re-inspection
7              Cycle Inspection / Initial Inspection
8              Cycle Inspection / Initial Inspection
9                   Cycle Inspection / Re-inspection

Amazing! Our dataset is now much easier to read and use. We have identifiable columns and variables that are easy to work with thanks to our data wrangling process. We also corrected illogical data values and made the strings a little easier to read.

In this example, we worked with data that was rather tidy, in the sense that each row was an observation (a restaurant) and each column was a variable. However, what if our dataset was not tidy? What if our columns and rows needed reorganization?

## Tidy Data

Let’s take a look at a dataset that has information about the average annual wage for restaurant workers across New York City boroughs and New York City as a whole from the years 2000 and 2007. The data is from the New York State Department of Labor, Quarterly Census of Employment and Wages,and only contains six total rows.

In [70]:
nyqc_annual_wage = pd.DataFrame({'boro': ['Bronx', 'Brooklyn', 'Manhattan', 'Queens', 'Staten Island'],
                     '2000': [ 16392, 16713, 27020, 16692, 15143],
                     '2007': [ 16195, 17017, 27080, 16883, 14951]})
nyqc_annual_wage

            boro   2000   2007
0          Bronx  16392  16195
1       Brooklyn  16713  17017
2      Manhattan  27020  27080
3         Queens  16692  16883
4  Staten Island  15143  14951

There are three variables in this dataset: borough, year, and average annual income. However, we have values (2000 and 2007) in the column headers rather than variable names (year and average annual income). This is not ideal to work with, so let’s fix it! We will use the melt() function in pandas to turn the current values (2000 and 2007) in the column headers into row values and add year and avg_annual_wage as our column labels.

In [71]:
nyqc_annual_wage = nyqc_annual_wage.melt(
    # which column to use as identifier variables
    id_vars=['boro'],
    # column name to use for “variable” names/column headers (ie. 2000 and 2007)
    var_name=['year'],
    # column name for the values originally in the columns 2000 and 2007
    value_name="avg_annual_wage"
)

print(nyqc_annual_wage)

            boro  year  avg_annual_wage
0          Bronx  2000            16392
1       Brooklyn  2000            16713
2      Manhattan  2000            27020
3         Queens  2000            16692
4  Staten Island  2000            15143
5          Bronx  2007            16195
6       Brooklyn  2007            17017
7      Manhattan  2007            27080
8         Queens  2007            16883
9  Staten Island  2007            14951